/*
// Задача 1.

Console.Write("введите число ");
int num = Convert.ToInt32(Console.ReadLine());

int quad = num * num;

Console.WriteLine($"квадрат из числа {num} это {quad}");
*/


// Задача 2.


